---
title: "Gitcoin Grants： 对公共物品融资模式的探索"
titlePlain: "加密经济学"
description: '二次方融资'
tags: blockchain
created: 2020-02-02 20:32
status: finished
previous: './blockchain/uniswap-social-money'
next: './blockchain/sound-money'
confidence: possible
importance: 4
cssExtension: drop-caps-kanzlei
...

**Gitcoin Grants** 是一个为以太坊开源项目 周期性地提供资金的众筹平台，它采用二次方融资 **CLR** 机制 *（Capital-constrained Liberal Radicalism）* ，该机制是 Vitalik Buterin 和《 **激进市场** 》作者之一的 **Glen Weyl** 在《Liberal Radicalism: Formal Rules for a Society Neutral among Communities》论文中提出的。
可以说 Gitcoin Grants 是区块链技术与激进市场二次方投票思想 *（二次方融资是对二次方投票的扩展）* 的一次非常好的的实践，它探索的是如何以数学最佳的方式资助开源项目 / 公共物品，这是我对这个项目非常感兴趣的原因。

## 什么是 Gitcoin Grant 
Gitcoin Grant 是一个为以太坊开源项目周期性提供资金的众筹平台，采用一种叫做二次方融资 CLR  机制 (Capital-constrained Liberal Radicalism)，该机制是 V 神和《激进市场》作者之一的  Glen Weyl 在《Liberal Radicalism: Formal Rules for a Society Neutral among Communities》论文中提出， Gitcoin Grant 是激进市场提出的二次方投票思想和区块链技术一次非常好的的实践，这也是我对于这个项目非常感兴趣的原因，如何以数学最佳方式帮助资助开源项目，具体是通过对项目的捐赠的平方根之和来确定配捐的金额。


## 一次典型的 Gitcoin 融资过程是怎样的
二次方融资 CLR 机制包括 **众筹** 和 **配捐** 两个部分：
* 众筹：个人对公共物品捐款，把每个人捐款金额的平方根加起来得到 A，再对 A 求平方得到 B，B 就是项目方应该获得的资助总额。
* 配捐：项目方应得的金额，也就是 B，是大于每个捐款人捐出的金额的总和的，便由基金会或私人慈善家补足这个差额。在这种机制下，项目获得的资金与一共有多少人支持关联度变得更高，如果某个项目的捐款人越多，该项目方获得的匹配资金就越多。


自2019年1月启动以来，Gitcoin Grants 已帮助向开源分发了82.7万美元，Gitcoin计划在2020年至少每季度进行一次，在明年 2020 Q1 时间定在1.6-1.21，以太坊基金会配捐 12.5 万美元。

1、项目开发者通过申请加入到接受捐款的候选名单，提交项目的相关介绍和每个月需要的资金。

2、用户选择自己的喜欢的项目赞助，可以选择共赞助多少资金，以及资金是分多少个周期，分发给项目开发者。通过通过 Gitcoin Grant 捐助，平台会有5％的费用。



3、以太坊基金会跟进捐赠的平方根之和来确定配捐的金额

在近年第三轮配捐比赛，为 68 个开源项目提供了1,982笔独特的捐款，价值17万美元，其中的项目以太坊社区 EthHub，ETH 2.0 Go 客户端 Prysm，智能合约钱包 Burner Wallet。


## 二次方融资解决的是什么问题？

事实上，在一个社会配置公共物品时，会面临的最基本的两个问题，就是搭便车问题和倾轧少数派利益的问题。

事实上，在一个社会配置公共物品时会面临两个最基本的问题：搭便车问题和倾轧少数派利益的问题。
在「一人一票」方式下，一张选票对结果的影响微不足道，因此理性人不会去投票，这会造成搭便车现象，融资也是一样的道理，本来想资助项目的人，认为自己的一块钱不能帮助到项目方，就不会参与；但如果采用二次方融资的方式，一块钱会被放大，理性人会有动力参与众筹，从而减少搭便车现象。
在「一人一票」方式下，少数服从多数，系统不能反应多样的产品对不同个体的重要性，进而会压制少数派的利益，放在融资中，资助哪些项目是由多数投票决定的；如果采用二次方融资，个人可以选择资助自己感兴趣的项目，并间接影响该项目的配捐金额，这可以部分解决倾轧少数派利益的问题。

搭便车：即出于公共物品的非排他性和非竞争性特质，导致一些人事先宣称自己不需要某类公共物品，在他人付出成本争取到之后，不劳而获地享用这个公共产品的行为。一个系统中，越多的人对公共物品搭便车，公共物品的供给越是不足，市场会因此逐渐失灵
倾轧少数派利益：当一个系统完全基于一人一票模式时，这个系统就不能够反应多样的产品对个人的重要性，进而压制了少数派的利益。



## 二次方融资解决了那些问题
1、解决 ICO 项目方资金滥用的问题。
二次方融资本身是基于《激进市场》一书中提到的二次方投票方法的扩展，用于自组织社区分配资金维护公共物品（如开源项目），而不受搭便车问题影响，项目方融资获得的资金缓慢释放，释放的速度取决于项目参与者的数量以及他们的参与程度。

2、大户的影响大大降低。
项目收到的金额是所收到捐款的平方根总和的平方。这样，项目获得的资金和大户关联度变得更低，和一共有多少人支持关联度变得更高。

## 二次方融资目前面临的问题
1、女巫攻击：Gitcoin Grant 身份系统依托的是 Github 账户，身份造假实在是太容易了。
2、串通：系统的攻击者可以将100美元分成10个人的手，从而获得比应有的高得多的 CLR 配捐。


## 二次方融资与MolochDao 的不同
都是为解决公地悲剧问题，MolochDao  是通过中心化的方式，为以太坊公共基础设施提供资金的集体目标进行协调，还是存在一人一票，少数人服从多数人的问题。

Gitcoin Grant 二次方融资，提出来新的激进市场的二次方投票的方案。Gitcoin Grant 属于捐赠行为，本身以太坊社区项目都会提供一个接收赞助的地址，但二次方融资，可以把这种力量放大。